Revit 2027 API
FabricationConfiguration.GetProfile Method
 Return the profile of the loaded fabrication configuration. Return empty string for global profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetProfile()
Public Function GetProfile As String
public:
String^ GetProfile()
member GetProfile : unit -> string
Return Value
String
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace